title: Suspicious Child Process of Confluence
id: 4dcf8f65-0d56-4877-ae02-2c6d29ef698d
status: stable
description: Detects suspicious child processes of the Confluence Java application. May be a result of successful exploitation of CVE-2021-26084 or CVE-2022-26134.
author: Charlie Stafford
date: 2022/06/03
modified: 2022/06/03
references:
    - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        ParentImage|endswith: '/java'
        ParentImage|contains: '/confluence/'
    selection2:
        Image|endswith: '/java'
        Image|contains: '/confluence/'
    selection3:
        CommandLine|contains:
            - '/usr/bin/getconf PAGE_SIZE'
            - 'ulimit -u'
    condition: selection and not selection2 and not selection3
falsepositives:
    - Legitimate administration activities (rare)
level: high
tags:
    - attack.initial_access
    - attack.t1190
